In [1]:
#numpy size
#.npy files

In [2]:
##pandas

In [ ]:
1. pandas is library built on top of numpy
2. it allows for fast analysis and data cleaning and prepration
3. built in visualization features
4. can work with data from wide variety of sources
5. support to read and write CSV and text files, Microsoft Excel, SQL databases, and the fast HDF5 format
6. Highly optimized for performance

In [2]:
import numpy as np

In [3]:
import pandas as pd

In [4]:
my_list = [1,2,3]
np_arr = np.array(my_list)

In [5]:
pd.Series(data=my_list,dtype=np.int32)

0    1
1    2
2    3
dtype: int32

In [6]:
labels = ['a','b','c']

In [17]:
pd.Series(data=my_list, index=labels)

a    1
b    2
c    3
dtype: int64

In [18]:
np_arr

array([1, 2, 3])

In [19]:
pd.Series(np_arr)

0    1
1    2
2    3
dtype: int32

In [25]:
my_dict = {'ab':10,'cd':20,'ef':30} 
my_dict

{'ab': 10, 'cd': 20, 'ef': 30}

In [30]:
pd.Series(my_dict, index=['ab','cd','ef'])

ab    10
cd    20
ef    30
dtype: int64

In [31]:
my_dict

{'ab': 10, 'cd': 20, 'ef': 30}

In [34]:
ser_data = [10,20,30,50]
ser_arr = np.array(ser_data)

In [35]:
series_data = pd.Series(ser_arr,['Delhi','Mumbai','Mohali','Chandigarh'])

In [36]:
series_data

Delhi         10
Mumbai        20
Mohali        30
Chandigarh    50
dtype: int32

In [ ]:
## data frames

In [7]:
from numpy.random import randn

In [8]:
ser_data = [[500,45455121,5],[300,np.nan,5],[650,8847451,4.5]]
ser_arr = np.array(ser_data)
ser_arr

array([[5.0000000e+02, 4.5455121e+07, 5.0000000e+00],
       [3.0000000e+02,           nan, 5.0000000e+00],
       [6.5000000e+02, 8.8474510e+06, 4.5000000e+00]])

In [9]:
cities = ['mohali','chandigarh','panchkula']

In [10]:
attribs = ['area','population','rating']

In [6]:
##creating df

In [11]:
df = pd.DataFrame(data=ser_arr, index=cities, columns=attribs)

In [12]:
df

             area  population  rating
mohali      500.0  45455121.0     5.0
chandigarh  300.0         NaN     5.0
panchkula   650.0   8847451.0     4.5

In [48]:
df['area'] #column name, type check, multiple

mohali        500.0
chandigarh    300.0
panchkula     650.0
Name: area, dtype: float64

In [13]:
df['density'] = df['population']/df['area']

In [14]:
df

             area  population  rating       density
mohali      500.0  45455121.0     5.0  90910.242000
chandigarh  300.0         NaN     5.0           NaN
panchkula   650.0   8847451.0     4.5  13611.463077

In [ ]:
##deletion #inplace

In [64]:
df.drop('density',axis=1)

             area    population  rating
mohali      500.0  4.545512e+07     5.0
chandigarh  300.0  6.545644e+09     5.0
panchkula   650.0  8.847451e+06     4.5

In [108]:
df['density']

mohali        9.091024e+04
chandigarh    2.181881e+07
panchkula     1.361146e+04
Name: density, dtype: float64

In [66]:
df.drop('density',axis=1, inplace=True)

In [67]:
df

             area    population  rating
mohali      500.0  4.545512e+07     5.0
chandigarh  300.0  6.545644e+09     5.0
panchkula   650.0  8.847451e+06     4.5

In [68]:
df.drop('mohali')

             area    population  rating
chandigarh  300.0  6.545644e+09     5.0
panchkula   650.0  8.847451e+06     4.5

In [69]:
df

             area    population  rating
mohali      500.0  4.545512e+07     5.0
chandigarh  300.0  6.545644e+09     5.0
panchkula   650.0  8.847451e+06     4.5

In [70]:
df.shape

(3, 3)

In [ ]:
##slicing and selection

In [72]:
df[0,0]

KeyError: (0, 0)

In [82]:
df.loc['mohali','rating']   #by row, column names or by position

5.0

In [83]:
df

             area    population  rating
mohali      500.0  4.545512e+07     5.0
chandigarh  300.0  6.545644e+09     5.0
panchkula   650.0  8.847451e+06     4.5

In [87]:
df.loc[['mohali'],['area']]

         area
mohali  500.0

In [88]:
df.iloc[0:2]            #by index

             area    population  rating
mohali      500.0  4.545512e+07     5.0
chandigarh  300.0  6.545644e+09     5.0

In [ ]:
##conditional selection

In [27]:
df

             area    population  rating
mohali      500.0  4.545512e+07     5.0
chandigarh  300.0  6.545644e+09     5.0
panchkula   650.0  8.847451e+06     4.5

In [91]:
rd = df < 5

In [95]:
rd['area'].dtype

dtype('bool')

In [96]:
rd

             area  population  rating
mohali      False       False   False
chandigarh  False       False   False
panchkula   False       False    True

In [97]:
df[df < 1]

            area  population  rating
mohali       NaN         NaN     NaN
chandigarh   NaN         NaN     NaN
panchkula    NaN         NaN     NaN

In [99]:
df['rating'] < 5

mohali        False
chandigarh    False
panchkula      True
Name: rating, dtype: bool

In [98]:
df

             area    population  rating
mohali      500.0  4.545512e+07     5.0
chandigarh  300.0  6.545644e+09     5.0
panchkula   650.0  8.847451e+06     4.5

In [102]:
df[df['rating'] < 5]

            area  population  rating
panchkula  650.0   8847451.0     4.5

In [103]:
df

             area    population  rating
mohali      500.0  4.545512e+07     5.0
chandigarh  300.0  6.545644e+09     5.0
panchkula   650.0  8.847451e+06     4.5

In [9]:
df[(df['rating'] > 4 ) & (df['area'] >= 500)]

            area  population  rating
mohali     500.0  45455121.0     5.0
panchkula  650.0   8847451.0     4.5

In [11]:
df[(df['population']/df['area']) >= df.loc['mohali','rating']]['rating']

mohali        5.0
chandigarh    5.0
panchkula     4.5
Name: rating, dtype: float64

In [12]:
df[(df.population/df.area) >= (df.loc['mohali','population'] / df.loc['mohali','area'])].rating

mohali        5.0
chandigarh    5.0
Name: rating, dtype: float64

In [13]:
df[(df['population']/df['area']) >= (df.loc['mohali','population'] / df.loc['mohali','area'])]['rating']

mohali        5.0
chandigarh    5.0
Name: rating, dtype: float64

In [14]:
df

             area    population  rating
mohali      500.0  4.545512e+07     5.0
chandigarh  300.0  6.545644e+09     5.0
panchkula   650.0  8.847451e+06     4.5

In [15]:
df.reset_index()

        index   area    population  rating
0      mohali  500.0  4.545512e+07     5.0
1  chandigarh  300.0  6.545644e+09     5.0
2   panchkula  650.0  8.847451e+06     4.5

In [16]:
df

             area    population  rating
mohali      500.0  4.545512e+07     5.0
chandigarh  300.0  6.545644e+09     5.0
panchkula   650.0  8.847451e+06     4.5

In [17]:
df.reset_index(inplace=True)

In [20]:
df.reset_index(inplace=True)

In [22]:
df.reset_index(inplace=True)

ValueError: cannot insert level_0, already exists

In [27]:
df.columns = ['new_level','index','area','population','rating']

In [29]:
df.reset_index(inplace=True)

In [30]:
df

   level_0  new_level       index   area    population  rating
0        0          0      mohali  500.0  4.545512e+07     5.0
1        1          1  chandigarh  300.0  6.545644e+09     5.0
2        2          2   panchkula  650.0  8.847451e+06     4.5

In [ ]:
df.set_index('area',inplace=True)

In [ ]:
df

In [31]:
df.index

RangeIndex(start=0, stop=3, step=1)

In [34]:
df.loc[0,'level_0']

0

In [37]:
df.head(5)

   level_0  new_level       index   area    population  rating
0        0          0      mohali  500.0  4.545512e+07     5.0
1        1          1  chandigarh  300.0  6.545644e+09     5.0
2        2          2   panchkula  650.0  8.847451e+06     4.5

In [39]:
df.tail(2)

   level_0  new_level       index   area    population  rating
1        1          1  chandigarh  300.0  6.545644e+09     5.0
2        2          2   panchkula  650.0  8.847451e+06     4.5

In [24]:
df.shape

(3, 3)

In [47]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 3 entries, mohali to panchkula
Data columns (total 3 columns):
area          3 non-null float64
population    2 non-null float64
rating        3 non-null float64
dtypes: float64(3)
memory usage: 96.0+ bytes

In [46]:
df.describe()

             area    population    rating
count    3.000000  2.000000e+00  3.000000
mean   483.333333  2.715129e+07  4.833333
std    175.594229  2.588553e+07  0.288675
min    300.000000  8.847451e+06  4.500000
25%    400.000000  1.799937e+07  4.750000
50%    500.000000  2.715129e+07  5.000000
75%    575.000000  3.630320e+07  5.000000
max    650.000000  4.545512e+07  5.000000

In [48]:
s = pd.Series([1, 2, 3, 4])
s.describe()

count    4.000000
mean     2.500000
std      1.290994
min      1.000000
25%      1.750000
50%      2.500000
75%      3.250000
max      4.000000
dtype: float64

In [1]:
df

NameError: name 'df' is not defined

In [ ]:
df[df['population']/df['area'] > df.loc['mohali','population'] / df.loc['mohali','area']]['rating']

In [ ]:
##cleaning

In [49]:
missing_data = {'a':[1,2,np.nan],'b':[3,np.nan,np.nan],'c':[5,8,9]}

In [50]:
df = pd.DataFrame(missing_data)

In [51]:
df

     a    b  c
0  1.0  3.0  5
1  2.0  NaN  8
2  NaN  NaN  9

In [53]:
df.dropna()

     a    b  c
0  1.0  3.0  5

In [54]:
df

     a    b  c
0  1.0  3.0  5
1  2.0  NaN  8
2  NaN  NaN  9

In [10]:
df.dropna(axis=1,thresh=2)

     a  c
0  1.0  5
1  2.0  8
2  NaN  9

In [58]:
df.dropna(thresh=1)

     a    b  c
0  1.0  3.0  5
1  2.0  NaN  8
2  NaN  NaN  9

In [60]:
df.fillna(0)

TypeError: fillna() got an unexpected keyword argument 'thresh'

In [ ]:
##group by

In [90]:
comp_data = {'company':['Apple','Apple','Apple','Google','Google','Microsoft','Microsoft'],
             'location':['US','IN','US','US','IN','US','IN'],
             'sales':[1500,452,452,250,452,415,221],
             'employee':[500,4520,42,2550,4552,48815,2721]
            }

In [91]:
df = pd.DataFrame(comp_data)

In [92]:
df

     company  employee location  sales
0      Apple       500       US   1500
1      Apple      4520       IN    452
2      Apple        42       US    452
3     Google      2550       US    250
4     Google      4552       IN    452
5  Microsoft     48815       US    415
6  Microsoft      2721       IN    221

In [93]:
by_company = df.groupby('company')

In [68]:
gb = by_company.groups
gb
# for key, values in gb.iteritems():
#     print(df.ix[values], "\n\n")

{'Apple': Int64Index([0, 1], dtype='int64'),
 'Google': Int64Index([2, 3], dtype='int64'),
 'Microsoft': Int64Index([4, 5], dtype='int64')}

In [71]:
by_company.sum().loc['Apple','sales']

602

In [102]:
by_company

In [84]:
by_company.count()

           employee  location  sales
company
Apple             3         3      3
Google            2         2      2
Microsoft         2         2      2

In [95]:
df

     company  employee location  sales
0      Apple       500       US   1500
1      Apple      4520       IN    452
2      Apple        42       US    452
3     Google      2550       US    250
4     Google      4552       IN    452
5  Microsoft     48815       US    415
6  Microsoft      2721       IN    221

In [99]:
by_company.max()

           employee location  sales
company
Apple          4520       US   1500
Google         4552       US    452
Microsoft     48815       US    415

In [ ]:
##concat, merge and join

In [5]:
dummy_data1 = {
        'id': ['1', '2', '3', '4', '5'],
        'Feature1': ['A', 'C', 'E', 'G', 'I'],
        'Feature2': ['B', 'D', 'F', 'H', 'J']}
df1 = pd.DataFrame(dummy_data1, columns = ['id', 'Feature1', 'Feature2'])

In [6]:
dummy_data2 = {
        'id': ['1', '2', '6', '7', '8'],
        'Feature1': ['K', 'M', 'O', 'Q', 'S'],
        'Feature2': ['L', 'N', 'P', 'R', 'T']}
df2 = pd.DataFrame(dummy_data2, columns = ['id', 'Feature1', 'Feature2'])

In [7]:
dummy_data3 = {
        'id': ['1', '2', '3', '4', '5', '7', '8', '9', '10', '11'],
        'Feature3': [12, 13, 14, 15, 16, 17, 15, 12, 13, 23]}

df3 = pd.DataFrame(dummy_data3, columns = ['id', 'Feature3'])

In [12]:
df1

   id  Feature3
0   1        12
1   2        13
2   3        14
3   4        15
4   5        16
5   7        17
6   8        15
7   9        12
8  10        13
9  11        23

In [ ]:
df2

In [ ]:
df3

In [13]:
df_row = pd.concat([df1, df2])   #ignore_index

In [14]:
df_row

  id Feature1 Feature2
0  1        A        B
1  2        C        D
2  3        E        F
3  4        G        H
4  5        I        J
5  1        K        L
6  2        M        N
7  6        O        P
8  7        Q        R
9  8        S        T

In [17]:
df_keys = pd.concat([df1,df2], keys=['df1', 'df2'])

In [18]:
df_keys

      id Feature1 Feature2
df1 0  1        A        B
    1  2        C        D
    2  3        E        F
    3  4        G        H
    4  5        I        J
df2 0  1        K        L
    1  2        M        N
    2  6        O        P
    3  7        Q        R
    4  8        S        T

In [19]:
df_keys.loc['df1']

  id Feature1 Feature2
0  1        A        B
1  2        C        D
2  3        E        F
3  4        G        H
4  5        I        J

In [20]:
df_col = pd.concat([df1,df2], axis=1)

df_col

  id Feature1 Feature2 id Feature1 Feature2
0  1        A        B  1        K        L
1  2        C        D  2        M        N
2  3        E        F  6        O        P
3  4        G        H  7        Q        R
4  5        I        J  8        S        T

In [27]:
df_row

  id Feature1 Feature2
0  1        A        B
1  2        C        D
2  3        E        F
3  4        G        H
4  5        I        J
5  1        K        L
6  2        M        N
7  6        O        P
8  7        Q        R
9  8        S        T

In [28]:
df3

   id  Feature3
0   1        12
1   2        13
2   3        14
3   4        15
4   5        16
5   7        17
6   8        15
7   9        12
8  10        13
9  11        23

In [21]:
df_merge_col = pd.merge(df_row, df3, on='id')

df_merge_col

  id Feature1 Feature2  Feature3
0  1        A        B        12
1  1        K        L        12
2  2        C        D        13
3  2        M        N        13
4  3        E        F        14
5  4        G        H        15
6  5        I        J        16
7  7        Q        R        17
8  8        S        T        15

In [29]:
df_outer = pd.merge(df1, df2, on='id', how='outer')

df_outer

  id Feature1_x Feature2_x Feature1_y Feature2_y
0  1          A          B          K          L
1  2          C          D          M          N
2  3          E          F        NaN        NaN
3  4          G          H        NaN        NaN
4  5          I          J        NaN        NaN
5  6        NaN        NaN          O          P
6  7        NaN        NaN          Q          R
7  8        NaN        NaN          S          T

In [30]:
df_outer = pd.merge(df1, df2, on='id', how='inner')

df_outer

  id Feature1_x Feature2_x Feature1_y Feature2_y
0  1          A          B          K          L
1  2          C          D          M          N

In [31]:
df_suffix = pd.merge(df1, df2, left_on='id',right_on='id',how='outer',suffixes=('_left','_right'))
df_suffix

  id Feature1_left Feature2_left Feature1_right Feature2_right
0  1             A             B              K              L
1  2             C             D              M              N
2  3             E             F            NaN            NaN
3  4             G             H            NaN            NaN
4  5             I             J            NaN            NaN
5  6           NaN           NaN              O              P
6  7           NaN           NaN              Q              R
7  8           NaN           NaN              S              T

In [32]:
df_right = pd.merge(df1, df2, on='id', how='right')

df_right

  id Feature1_x Feature2_x Feature1_y Feature2_y
0  1          A          B          K          L
1  2          C          D          M          N
2  6        NaN        NaN          O          P
3  7        NaN        NaN          Q          R
4  8        NaN        NaN          S          T

In [33]:
df_left = pd.merge(df1, df2, on='id', how='left')

df_left

  id Feature1_x Feature2_x Feature1_y Feature2_y
0  1          A          B          K          L
1  2          C          D          M          N
2  3          E          F        NaN        NaN
3  4          G          H        NaN        NaN
4  5          I          J        NaN        NaN

In [ ]:
describe, groupby view